In [1]:
import numpy as np
import pandas as pd

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
#array representation
obj.array
#default index: array from 0 through n-1
obj.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
#we can create a series with an index identifying a data point as a label
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [5]:
#view the index of obj2
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [6]:
obj2.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [7]:
#use index labels to select single values or a set of values
obj2['a']

-5

In [8]:
obj2["d"] = 6

In [9]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [10]:
#using numpy functions or numpy-like operations preserves the index/value link
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [11]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
#series as fixed-length ordered dictionaries
#create a series using a dictionary
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [14]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
#convert back to dict with the to_dict method
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [18]:
#key insertion order is preserved, to alter this, you can specifiy a dictionary
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [19]:
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
#The above example includes an nan value
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
#series can call these as instance methods
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
#series arithmetic
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [27]:
#name attribute can be used to create a pandas column name
obj4.name = 'population'
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [28]:
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [29]:
#series's index can be altered in place by assignment
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [30]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [31]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [32]:
#pd.DataFrame: it is the pandas equivalent of a spreadsheet: a rectangular 2-dimensional table of data.
#row index and column index

In [33]:
#passing a dictionary of equal-length lists or numpy arrays
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.3]}
frame = pd.DataFrame(data)

In [34]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.3

In [35]:
#first five rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [36]:
#last five rows
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.3

In [37]:
#create without specified sequence of columns
pd.DataFrame(data)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.3

In [38]:
#create with specified sequence of columns
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.3

In [39]:
#create a new empty column filled with np.nan values
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])

In [40]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.3  NaN

In [41]:
#we can set a scalar value to fill a column
frame2['debt'] = 16.5

In [42]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.3  16.5

In [43]:
#we can also use a numpy series
frame2['debt'] = np.arange(6.)

In [44]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.3   5.0

In [45]:
#when we assign lists or to a column, the length must match exactly
#if we assign a series, then its labels will be realigned exactly to the frame's index
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [46]:
frame2['debt'] = val

In [47]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.3   NaN

In [48]:
#assigning a column that does not exist will create a new column
#del keyword will delete columns like in a dictionary
frame2['eastern'] = frame2['state'] == 'Ohio'

In [49]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.3   NaN    False

In [50]:
#new columns cannot be created with the frame2.eastern dot attribute notation
frame2.western = frame2['state'] = 'Nevada'
#nothing happens

In [51]:
del frame2['eastern']

In [52]:
frame2

   year   state  pop  debt
0  2000  Nevada  1.5   NaN
1  2001  Nevada  1.7   NaN
2  2002  Nevada  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.3   NaN

In [53]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [55]:
#column returned from indexing a dataframe is a view on underlying data, not a copy
#nested dictionary of dictionaries
#! ipython id=0b3c30df8ab14ab1a3486d88b9f23890
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

In [56]:
frame3 = pd.DataFrame(populations)

In [57]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [58]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [59]:
pd.DataFrame(populations)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [61]:
pd.DataFrame(populations, index=np.arange(2001, 2004))

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [62]:
pd.DataFrame(populations, index=pd.Index(np.arange(2001, 2004)))

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [ ]:
#pdata = {'Ohio'}